In [1]:
names=["Tomás", "Pauline", "Pablo", "Bjork","Alan","Juana"]
woman=[False,True,False,False,False,True]
ages=[32,33,28,30,32,27]
country=["Chile", "Senegal", "Spain", "Norway","Peru","Peru"]
education=["Bach", "Bach", "Master", "PhD","Bach","Master"]

In [3]:
data={'names':names,'woman':woman, 'ages':ages,'country':country,'education':education}

In [4]:
import pandas

In [5]:
students=pandas.DataFrame.from_dict(data)

In [6]:
from pandas import DataFrame as df

In [7]:
students=df.from_dict(data)
students

     names  woman  ages  country education
0    Tomás  False    32    Chile      Bach
1  Pauline   True    33  Senegal      Bach
2    Pablo  False    28    Spain    Master
3    Bjork  False    30   Norway       PhD
4     Alan  False    32     Peru      Bach
5    Juana   True    27     Peru    Master

In [8]:
oldFriends=students(students.ages>30)

TypeError: 'DataFrame' object is not callable

In [9]:
students

     names  woman  ages  country education
0    Tomás  False    32    Chile      Bach
1  Pauline   True    33  Senegal      Bach
2    Pablo  False    28    Spain    Master
3    Bjork  False    30   Norway       PhD
4     Alan  False    32     Peru      Bach
5    Juana   True    27     Peru    Master

In [10]:
students.ages

0    32
1    33
2    28
3    30
4    32
5    27
Name: ages, dtype: int64

In [11]:
[x for x in students.ages]

[32, 33, 28, 30, 32, 27]

In [12]:
[x*2 for x in students.ages]

[64, 66, 56, 60, 64, 54]

In [20]:
[x for x in zip(students.ages,students.education)]

[(32, 'Bach'),
 (33, 'Bach'),
 (28, 'Master'),
 (30, 'PhD'),
 (32, 'Bach'),
 (27, 'Master')]

In [21]:
[x[0] for x in zip(students.ages,students.education)] # 0 is referring to the first element

[32, 33, 28, 30, 32, 27]

In [15]:
list(zip(students.ages, students.education))

[(32, 'Bach'),
 (33, 'Bach'),
 (28, 'Master'),
 (30, 'PhD'),
 (32, 'Bach'),
 (27, 'Master')]

In [22]:
[(n,c) for n,c in zip(students.names, students.country)]

[('Tomás', 'Chile'),
 ('Pauline', 'Senegal'),
 ('Pablo', 'Spain'),
 ('Bjork', 'Norway'),
 ('Alan', 'Peru'),
 ('Juana', 'Peru')]

In [25]:
counterOfPeruvian=0
for x in students.country:
    print('i got', x)
    if x=='Peru':
        print('found one',x)
        counterOfPeruvian +=1 
    else:
        print('nope',x)
counterOfPeruvian

i got Chile
nope Chile
i got Senegal
nope Senegal
i got Spain
nope Spain
i got Norway
nope Norway
i got Peru
found one Peru
i got Peru
found one Peru

2

In [27]:
len(students(students.country=='Peru'))

TypeError: 'DataFrame' object is not callable

In [29]:
students[students.country=='Peru'].dropna().shape[0]

2

In [38]:
counterOfMenBach=0
for value in zip(students.woman, students.education):
    if (value[0]==False)& (value[1]=='Bach'):
        counterOfMenBach +=1
        
counterOfMenBach

2

In [35]:
counterofmenbach=0

for x,y in zip(~students.woman, students.education):
    if x and y=='Bach':
        counterofmenbach +=1

counterofmenbach

2